app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-09-17 09:21:39.500535"], ["updated_at", "2018-09-17 09:21:39.500535"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-09-17 09:21:39.511938"], ["updated_at", "2018-09-17 09:21:39.511938"]]
---
  def upload
    CSV.foreach(params[:leads].path, headers: true) do |lead|
      Song.create(song_name: lead[0], artist_name: lead[1], release_year: lead[2])